source/org_posts/2014-04-23-railsconf-2014.org
#+BEGIN_HTML
---
layout: post
title: "RailsConf 2014"
date: 2014-04-23 08:02:41 -0500
comments: true
categories: 
keywords: 
description: RailsConf Notes
---
#+END_HTML

* My Talk: Concerns, Decorators, Presenters, Service Objects, Helpers, Help me Decide

#+begin_html
<script async class="speakerdeck-embed" data-slide="2" data-id="3e567380b1ea013103f01263d01a0296" data-ratio="1.77777777777778" src="//speakerdeck.com/assets/embed.js"></script>
#+end_html

{% img /images/2014-04-23-RailsConf/railsconf-fat-models-book-title.JPG %}

- [[https://github.com/justin808/fat-code-refactoring-techniques][Fat Code Refactoring Techniques Code Samples on Github]]
- [[https://www.icloud.com/iw/#keynote/BALu9Dy-Dcbu1PvWluyB_G-jq5C6URGmij2F/RailsConf-2014-Concerns-Decorators-Presenters-Service-Objects-Helpers-Help-Me-Decide-April-22-2014][Keynote Slides with Animations]]
- [[http://www.confreaks.com/videos/3329-railsconf-concerns-decorators-presenters-service-objects-helpers-help-me-decide][Video of Presentation at Confreaks]] embedded here:
{% youtube bHpVdOzrvkE %}

* (Lack of) Live Coding in my Talk
Due to time constraints, I chose to skip the live coding I had prepared to do in
my talk. [[emailto:justin@railsonmaui.com][Please let me know]] if you'd be interested in a screencast walking
through the sample code. I will create one if there is sufficient demand.

#+begin_html
<!-- more -->
#+end_html

* RailsConf 2014 Pictures
- Please share, so long as you don't remove the watermark.
- [[emailto:justin@railsonmaui.com][Email me]] if you'd like any full size, non-watermarked copies.

** Photos on Flickr:
- [[https://www.flickr.com/photos/justingordon/sets/72157644405839722/][RailsConf 2014 All Photos in one Album]]
- [[https://www.flickr.com/photos/justingordon/sets/72157644406117431/][RailsConf 2014 Speaker Dinner]]
- [[https://www.flickr.com/photos/justingordon/sets/72157644419361535/][RailsConf 2014 Day 1]]
- [[https://www.flickr.com/photos/justingordon/sets/72157644406165341/][RailsConf 2014 Day 2]]
- [[https://www.flickr.com/photos/justingordon/sets/72157644419407845/][RailsConf 2014 Day 2 BaseCamp Party]]
- [[https://www.flickr.com/photos/justingordon/sets/72157644406193641/][RailsConf 2014 Day 3]]
- [[https://www.flickr.com/photos/justingordon/sets/72157644460514123/][RailsConf 2014 Day 3 Public House Party]]
- [[https://www.flickr.com/photos/justingordon/sets/72157644365234506/][RailsConf 2014 Day 4]]

** Photos on Facebook
The same photo albums on my [[https://www.facebook.com/railsonmaui][Rails on Maui Facebook Page]]. Please tag yourself and
your friends.
- [[https://www.facebook.com/media/set/?set%3Da.788587014486399.1073741836.484394724905631&type%3D3][RailsConf 2014 Day 0, speaker dinner]] 
- [[https://www.facebook.com/media/set/?set%3Da.788590134486087.1073741837.484394724905631&type%3D3&uploaded%3D52][RailsConf 2014 Day 1, including after party at the Public House]]
- [[https://www.facebook.com/media/set/?set%3Da.791901107488323.1073741839.484394724905631][RailsConf 2014 Day 2]]
- [[https://www.facebook.com/media/set/?set%3Da.788967167781717.1073741838.484394724905631&type%3D3][RailsConf 2014 Day 2, Basecamp Party]]
- [[https://www.facebook.com/media/set/?set%3Da.791902674154833.1073741840.484394724905631&type%3D3][RailsConf 2014 Day 3]]
- [[https://www.facebook.com/media/set/?set%3Da.791912494153851.1073741841.484394724905631][RailsConf 2014 Day 3, Public House Party]]
- [[https://www.facebook.com/media/set/?set%3Da.791913407487093.1073741842.484394724905631][RailsConf 2014 Day 4]]

I hope you like the pictures.
