source/_posts/2014-04-23-railsconf-2014.html
---
layout: post
title: "RailsConf 2014"
date: 2014-04-23 08:02:41 -0500
comments: true
categories: 
keywords: 
description: RailsConf Notes
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">My Talk: Concerns, Decorators, Presenters, Service Objects, Helpers, Help me Decide</h2>
<div class="outline-text-2" id="text-1">
<script async class="speakerdeck-embed" data-slide="2" data-id="3e567380b1ea013103f01263d01a0296" data-ratio="1.77777777777778" src="//speakerdeck.com/assets/embed.js"></script>

<p>
{% img /images/2014-04-23-RailsConf/railsconf-fat-models-book-title.JPG %}
</p>

<ul class="org-ul">
<li><a href="https://github.com/justin808/fat-code-refactoring-techniques">Fat Code Refactoring Techniques Code Samples on Github</a>
</li>
<li><a href="https://www.icloud.com/iw/#keynote/BALu9Dy-Dcbu1PvWluyB_G-jq5C6URGmij2F/RailsConf-2014-Concerns-Decorators-Presenters-Service-Objects-Helpers-Help-Me-Decide-April-22-2014">Keynote Slides with Animations</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">(Lack of) Live Coding in my Talk</h2>
<div class="outline-text-2" id="text-2">
<p>
Due to time constraints, I chose to skip the live coding I had prepared to do in
my talk. <a href="mailto:justin@railsonmaui.com">Please let me know</a> if you'd be interested in a screencast walking
through the sample code. I will create one if there is sufficient demand.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">RailsConf 2014 Pictures</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Please share, so long as you don't remove the watermark.
</li>
<li><a href="mailto:justin@railsonmaui.com">Email me</a> if you'd like any full size, non-watermarked copies.
</li>
</ul>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Photos on Flickr:</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://www.flickr.com/photos/justingordon/sets/72157644405839722/">RailsConf 2014 All Photos in one Album</a>
</li>
<li><a href="https://www.flickr.com/photos/justingordon/sets/72157644406117431/">RailsConf 2014 Speaker Dinner</a>
</li>
<li><a href="https://www.flickr.com/photos/justingordon/sets/72157644419361535/">RailsConf 2014 Day 1</a>
</li>
<li><a href="https://www.flickr.com/photos/justingordon/sets/72157644406165341/">RailsConf 2014 Day 2</a>
</li>
<li><a href="https://www.flickr.com/photos/justingordon/sets/72157644419407845/">RailsConf 2014 Day 2 BaseCamp Party</a>
</li>
<li><a href="https://www.flickr.com/photos/justingordon/sets/72157644406193641/">RailsConf 2014 Day 3</a>
</li>
<li><a href="https://www.flickr.com/photos/justingordon/sets/72157644460514123/">RailsConf 2014 Day 3 Public House Party</a>
</li>
<li><a href="https://www.flickr.com/photos/justingordon/sets/72157644365234506/">RailsConf 2014 Day 4</a>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Photos on Facebook</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The same photo albums on my <a href="https://www.facebook.com/railsonmaui">Rails on Maui Facebook Page</a>. Please tag yourself and
your friends.
</p>
<ul class="org-ul">
<li><a href="https://www.facebook.com/media/set/?set=a.788587014486399.1073741836.484394724905631&type=3">RailsConf 2014 Day 0, speaker dinner</a> 
</li>
<li><a href="https://www.facebook.com/media/set/?set=a.788590134486087.1073741837.484394724905631&type=3&uploaded=52">RailsConf 2014 Day 1, including after party at the Public House</a>
</li>
<li><a href="https://www.facebook.com/media/set/?set=a.791901107488323.1073741839.484394724905631">RailsConf 2014 Day 2</a>
</li>
<li><a href="https://www.facebook.com/media/set/?set=a.788967167781717.1073741838.484394724905631&type=3">RailsConf 2014 Day 2, Basecamp Party</a>
</li>
<li><a href="https://www.facebook.com/media/set/?set=a.791902674154833.1073741840.484394724905631&type=3">RailsConf 2014 Day 3</a>
</li>
<li><a href="https://www.facebook.com/media/set/?set=a.791912494153851.1073741841.484394724905631">RailsConf 2014 Day 3, Public House Party</a>
</li>
<li><a href="https://www.facebook.com/media/set/?set=a.791913407487093.1073741842.484394724905631">RailsConf 2014 Day 4</a>
</li>
</ul>

<p>
I hope you like the pictures.
</p>
</div>
</div>
</div>
